In [1]:
# !pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /Users/karinaaa74/opt/anaconda3/lib/python3.9/site-packages (2.9.5)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import String, Numeric,Date,create_engine, Integer
conn_url = 'postgresql://postgres:123@localhost/group_project'
engine = create_engine(conn_url)
connection = engine.connect()

In [2]:
df = pd.read_csv('most_funded2023.csv')

In [3]:
df.head()

,id,backers_count,blurb,category_id,category_name,category_parent_id,category_parent_name,category_url,country,created,...,project_url,spotlight,staff_pick,state,state_changed,state_changed_at,static_usd_rate,usd_exchange_rate,usd_pledged,usd_type
0,1497949659,185341,A Year of Sanderson: Enjoy books and swag boxe...,47,Fiction,18.0,Publishing,http://www.kickstarter.com/discover/categories...,US,1641845766,...,https://www.kickstarter.com/projects/dragonste...,True,True,successful,1648767600,3/31/22,1.0,1.0,41754153.24,domestic
1,1799979574,78471,Color e-paper smartwatch with up to 7 days of ...,28,Product Design,7.0,Design,http://www.kickstarter.com/discover/categories...,US,1423542328,...,https://www.kickstarter.com/projects/getpebble...,True,True,successful,1427508015,3/28/15,1.0,1.0,20338986.27,domestic
2,342886736,62642,The COOLEST is a portable party disguised as a...,28,Product Design,7.0,Design,http://www.kickstarter.com/discover/categories...,US,1382478674,...,https://www.kickstarter.com/projects/ryangrepp...,True,True,successful,1409360410,8/30/14,1.0,1.0,13285226.36,domestic
3,374744378,83193,Euro-inspired dungeon crawling sequel to the 2...,34,Tabletop Games,12.0,Games,http://www.kickstarter.com/discover/categories...,US,1581299604,...,https://www.kickstarter.com/projects/frosthave...,True,True,successful,1588366800,5/1/20,1.0,1.0,12969608.00,domestic
4,2103598555,66673,"Two affordable, heart rate-enabled smartwatche...",28,Product Design,7.0,Design,http://www.kickstarter.com/discover/categories...,US,1463341264,...,https://www.kickstarter.com/projects/getpebble...,True,True,successful,1467262800,6/30/16,1.0,1.0,12779843.49,domestic

In [4]:
# Pass the SQL statements that create all tables
stmt = """CREATE TABLE general_info (
id varchar(20) PRIMARY KEY,
backers_count int NOT NULL,
blurb varchar(500),
created_at date NOT NULL,
deadline date NOT NULL,
goal money NOT NULL
);

CREATE TABLE category (
category_id varchar(5) PRIMARY KEY,
category_name varchar(20) NOT NULL,
category_url VARCHAR(2048)
);

CREATE TABLE parent_category (
category_parent_id varchar(5) PRIMARY KEY,
category_parent_name varchar(20) NOT NULL
);

CREATE TABLE general_category (
id varchar(20) PRIMARY KEY,
category_id varchar(5) NOT NULL,
FOREIGN KEY (category_id) REFERENCES category	
);

CREATE TABLE category_parent_relation (
category_parent_id varchar(5),
category_id varchar(5),
PRIMARY KEY (category_id,category_parent_id),	
FOREIGN KEY (category_id) REFERENCES category,
FOREIGN KEY (category_parent_id) REFERENCES parent_category
);

CREATE TABLE location_info (
location_id varchar(10) PRIMARY KEY,
location_name varchar(50) NOT NULL,
location_state CHAR(50),
location_country varchar(10) NOT NULL,
location_type varchar(10)
);

CREATE TABLE profile (
profile_id varchar(10) PRIMARY KEY,
profile_name varchar(200),
profile_blurb varchar(500),
launched_at date NOT NULL,
project_url VARCHAR(2048),
location_id varchar(10),
spotlight BOOLEAN NOT NULL,
staff_pick BOOLEAN NOT NULL,
FOREIGN KEY (location_id) REFERENCES location_info
);

CREATE TABLE creator(
creator_id varchar(20) PRIMARY KEY,
creator_name varchar(50),
creator_url VARCHAR(2048),
id varchar(20),
profile_id varchar(10) NOT NULL,
FOREIGN KEY (id) REFERENCES general_info,
FOREIGN KEY (profile_id) REFERENCES profile
);

CREATE TABLE currency_info (
currency varchar(10) PRIMARY KEY,
fx_rate numeric NOT NULL
);

CREATE TABLE creation_currency (
creator_id varchar(20),
currency varchar(10),
PRIMARY KEY (creator_id,currency),
FOREIGN KEY (creator_id) REFERENCES creator,
FOREIGN KEY (currency) REFERENCES currency_info
);

CREATE TABLE profile_state_info (
state_id varchar(20) PRIMARY KEY,
profile_state varchar(20) NOT NULL,
profile_state_changed_at date NOT NULL,
state varchar(20) NOT NULL,
state_changed_at date NOT NULL
);

CREATE TABLE usd_pledged (
usd_pledged_id varchar(20) PRIMARY KEY,
usd_pledged numeric NOT NULL,
percent_funded numeric NOT NULL,
usd_type varchar(20) NOT NULL,
static_usd_rate numeric NOT NULL,
usd_exchange_rate numeric NOT NULL
);

CREATE TABLE profile_state (
profile_id varchar(10),
state_id varchar(20),
PRIMARY KEY (profile_id,state_id),
FOREIGN KEY (profile_id) REFERENCES profile,
FOREIGN KEY (state_id) REFERENCES profile_state_info
);

CREATE TABLE project_pledged (
profile_id varchar(10),
usd_pledged_id varchar(20),
PRIMARY KEY (profile_id,usd_pledged_id),
FOREIGN KEY (profile_id) REFERENCES profile,
FOREIGN KEY (usd_pledged_id) REFERENCES usd_pledged
);"""

# Execute the statement to create tables
connection.execute(stmt)

In [5]:
temp_general_info_df= df[['id', 'backers_count','blurb','created_at','deadline','goal']]

In [6]:
temp_general_info_df.head()

,id,backers_count,blurb,created_at,deadline,goal
0,1497949659,185341,A Year of Sanderson: Enjoy books and swag boxe...,1/10/22,3/31/22,1000000
1,1799979574,78471,Color e-paper smartwatch with up to 7 days of ...,2/10/15,3/28/15,500000
2,342886736,62642,The COOLEST is a portable party disguised as a...,10/22/13,8/30/14,50000
3,374744378,83193,Euro-inspired dungeon crawling sequel to the 2...,2/10/20,5/1/20,500000
4,2103598555,66673,"Two affordable, heart rate-enabled smartwatche...",5/15/16,6/30/16,1000000

In [7]:
# push the department data to the database
temp_general_info_df.to_sql(name='general_info', con=engine, if_exists='append', index=False)

400

In [8]:
temp_category_df= df[['category_id', 'category_name','category_url']]

In [9]:
temp_category_df.head()

,category_id,category_name,category_url
0,47,Fiction,http://www.kickstarter.com/discover/categories...
1,28,Product Design,http://www.kickstarter.com/discover/categories...
2,28,Product Design,http://www.kickstarter.com/discover/categories...
3,34,Tabletop Games,http://www.kickstarter.com/discover/categories...
4,28,Product Design,http://www.kickstarter.com/discover/categories...

In [10]:
# Drop duplicated catagory name
temp_category_df = temp_category_df.drop_duplicates(subset='category_name')

In [11]:
# return the results
temp_category_df

,category_id,category_name,category_url
0,47,Fiction,http://www.kickstarter.com/discover/categories...
1,28,Product Design,http://www.kickstarter.com/discover/categories...
3,34,Tabletop Games,http://www.kickstarter.com/discover/categories...
6,52,Hardware,http://www.kickstarter.com/discover/categories...
8,29,Animation,http://www.kickstarter.com/discover/categories...
...,...,...,...
2022,40,Indie Rock,http://www.kickstarter.com/discover/categories...
2095,42,Pop,http://www.kickstarter.com/discover/categories...
2127,306,Cookbooks,http://www.kickstarter.com/discover/categories...
2204,21,Digital Art,http://www.kickstarter.com/discover/categories...
2223,24,Performance Art,http://www.kickstarter.com/discover/categories...

In [12]:
# push the category data to the database
temp_category_df.to_sql(name='category', con=engine, if_exists='append', index=False)

83

In [13]:
temp_parent_category_df= df[['category_parent_id', 'category_parent_name']]

In [14]:
temp_parent_category_df

      category_parent_id category_parent_name
0                   18.0           Publishing
1                    7.0               Design
2                    7.0               Design
3                   12.0                Games
4                    7.0               Design
...                  ...                  ...
2395                16.0           Technology
2396                12.0                Games
2397                12.0                Games
2398                11.0         Film & Video
2399                12.0                Games

[2400 rows x 2 columns]

In [15]:
# Drop duplicated catagory name
temp_parent_category_df = temp_parent_category_df.drop_duplicates(subset='category_parent_id')

In [16]:
temp_parent_category_df

      category_parent_id category_parent_name
0                   18.0           Publishing
1                    7.0               Design
3                   12.0                Games
6                   16.0           Technology
8                   11.0         Film & Video
44                   NaN                  NaN
78                   9.0              Fashion
275                  1.0                  Art
360                 10.0                 Food
380                  3.0               Comics
430                 14.0                Music
563                 26.0               Crafts
1136                15.0          Photography
1535                17.0              Theater

In [17]:
temp_parent_category_df = temp_parent_category_df.dropna(subset=['category_parent_id'])

In [18]:
temp_parent_category_df

      category_parent_id category_parent_name
0                   18.0           Publishing
1                    7.0               Design
3                   12.0                Games
6                   16.0           Technology
8                   11.0         Film & Video
78                   9.0              Fashion
275                  1.0                  Art
360                 10.0                 Food
380                  3.0               Comics
430                 14.0                Music
563                 26.0               Crafts
1136                15.0          Photography
1535                17.0              Theater

In [19]:
# push the parent_category data to the database
temp_parent_category_df.to_sql(name='parent_category', con=engine, if_exists='append', index=False)

13

In [20]:
temp_general_category_df= df[['id', 'category_id']]

In [21]:
temp_general_category_df

              id  category_id
0     1497949659           47
1     1799979574           28
2      342886736           28
3      374744378           34
4     2103598555           28
...          ...          ...
2395  1570490740          337
2396   890327680           34
2397   339311773           34
2398   389066508          296
2399   741796936           34

[2400 rows x 2 columns]

In [22]:
# push the general_category data to the database
temp_general_category_df.to_sql(name='general_category', con=engine, if_exists='append', index=False)

400

In [23]:
temp_category_parent_relation_df= df[['category_parent_id', 'category_id']]

In [25]:
# Drop duplicated catagory name
temp_category_parent_relation_df = temp_category_parent_relation_df.drop_duplicates(subset='category_id')

In [26]:
temp_category_parent_relation_df

      category_parent_id  category_id
0                   18.0           47
1                    7.0           28
3                   12.0           34
6                   16.0           52
8                   11.0           29
...                  ...          ...
2022                14.0           40
2095                14.0           42
2127                10.0          306
2204                 1.0           21
2223                 1.0           24

[83 rows x 2 columns]

In [27]:
temp_category_parent_relation_df = temp_category_parent_relation_df.dropna(subset=['category_parent_id'])

In [28]:
# push the category_parent_relation data to the database
temp_category_parent_relation_df.to_sql(name='category_parent_relation', con=engine, if_exists='append', index=False)

70

In [29]:
temp_location_info_df= df[['location_id', 'location_name','location_state','location_country','location_type']]

In [30]:
temp_location_info_df

,location_id,location_name,location_state,location_country,location_type
0,2473779,Pleasant Grove,UT,US,Town
1,2467861,Palo Alto,CA,US,Town
2,2475687,Portland,OR,US,Town
3,2434562,Lafayette,IN,US,Town
4,2479714,Redwood City,CA,US,Town
...,...,...,...,...,...
2395,615702,Paris,Ile-de-France,FR,Town
2396,2406819,Framingham,MA,US,Town
2397,2487889,San Diego,CA,US,Town
2398,2348079,Auckland,Auckland Region,NZ,Town
2399,2364559,Birmingham,AL,US,Town

In [31]:
# Drop duplicated location_id
temp_location_info_df = temp_location_info_df.drop_duplicates(subset='location_id')

In [32]:
temp_location_info_df

,location_id,location_name,location_state,location_country,location_type
0,2473779,Pleasant Grove,UT,US,Town
1,2467861,Palo Alto,CA,US,Town
2,2475687,Portland,OR,US,Town
3,2434562,Lafayette,IN,US,Town
4,2479714,Redwood City,CA,US,Town
...,...,...,...,...,...
2374,674463,Meerbusch,North Rhine-Westphalia,DE,Town
2385,2442043,Los Altos,CA,US,Town
2390,2482949,Rochester,NY,US,Town
2393,2384020,Concord,CA,US,Town
2394,2357421,Ault,CO,US,Town

In [33]:
# push the location_info data to the database
temp_location_info_df.to_sql(name='location_info', con=engine, if_exists='append', index=False)

539

In [34]:
temp_profile_df= df[['profile_id', 'profile_name','profile_blurb','launched_at','project_url','location_id','spotlight','staff_pick']]

In [35]:
temp_profile_df

,profile_id,profile_name,profile_blurb,launched_at,project_url,location_id,spotlight,staff_pick
0,4334820,Surprise! Four Secret Novels by Brandon Sanderson,A Year of Sanderson: Enjoy books and swag boxe...,3/1/22,https://www.kickstarter.com/projects/dragonste...,2473779,True,True
1,1695644,"Pebble Time - Awesome Smartwatch, No Compromises",Color e-paper smartwatch with up to 7 days of ...,2/24/15,https://www.kickstarter.com/projects/getpebble...,2467861,True,True
2,746867,COOLEST COOLER: 21st Century Cooler that's Act...,The COOLEST is a portable party disguised as a...,7/8/14,https://www.kickstarter.com/projects/ryangrepp...,2475687,True,True
3,3930828,Frosthaven,Euro-inspired dungeon crawling sequel to the 2...,3/31/20,https://www.kickstarter.com/projects/frosthave...,2434562,True,True
4,2516776,"Pebble 2, Time 2 + All-New Pebble Core","Two affordable, heart rate-enabled smartwatche...",5/24/16,https://www.kickstarter.com/projects/getpebble...,2479714,True,True
...,...,...,...,...,...,...,...,...
2395,4391654,MULTO | Your own kitchen farm.,"Salads, herbs and small vegetables, grown at h...",4/28/22,https://www.kickstarter.com/projects/pretapous...,615702,True,True
2396,2993952,SORCERER,Sorcerer is a dark fantasy game that melds the...,11/7/17,https://www.kickstarter.com/projects/117293719...,2406819,True,False
2397,3401128,Bargain Quest Second Printing + The Black Mark...,The second printing and a new expansion for th...,8/6/18,https://www.kickstarter.com/projects/bargainqu...,2487889,True,True
2398,3811731,Baelin's Route - An Epic NPC Man Adventurer,A short-film following Baelin the Fisherman as...,3/3/20,https://www.kickstarter.com/projects/vldl/bael...,2348079,True,False
2399,3328105,Elder Dice: Unspeakable Tomes - Cthulhu Mythos...,"Lovecraftian designs: Yellow Sign of Hastur, S...",3/20/18,https://www.kickstarter.com/projects/infiniteb...,2364559,True,False

In [36]:
# Drop duplicated profile_id
temp_profile_df = temp_profile_df.drop_duplicates(subset='profile_id')

In [37]:
temp_profile_df

,profile_id,profile_name,profile_blurb,launched_at,project_url,location_id,spotlight,staff_pick
0,4334820,Surprise! Four Secret Novels by Brandon Sanderson,A Year of Sanderson: Enjoy books and swag boxe...,3/1/22,https://www.kickstarter.com/projects/dragonste...,2473779,True,True
1,1695644,"Pebble Time - Awesome Smartwatch, No Compromises",Color e-paper smartwatch with up to 7 days of ...,2/24/15,https://www.kickstarter.com/projects/getpebble...,2467861,True,True
2,746867,COOLEST COOLER: 21st Century Cooler that's Act...,The COOLEST is a portable party disguised as a...,7/8/14,https://www.kickstarter.com/projects/ryangrepp...,2475687,True,True
3,3930828,Frosthaven,Euro-inspired dungeon crawling sequel to the 2...,3/31/20,https://www.kickstarter.com/projects/frosthave...,2434562,True,True
4,2516776,"Pebble 2, Time 2 + All-New Pebble Core","Two affordable, heart rate-enabled smartwatche...",5/24/16,https://www.kickstarter.com/projects/getpebble...,2479714,True,True
...,...,...,...,...,...,...,...,...
2395,4391654,MULTO | Your own kitchen farm.,"Salads, herbs and small vegetables, grown at h...",4/28/22,https://www.kickstarter.com/projects/pretapous...,615702,True,True
2396,2993952,SORCERER,Sorcerer is a dark fantasy game that melds the...,11/7/17,https://www.kickstarter.com/projects/117293719...,2406819,True,False
2397,3401128,Bargain Quest Second Printing + The Black Mark...,The second printing and a new expansion for th...,8/6/18,https://www.kickstarter.com/projects/bargainqu...,2487889,True,True
2398,3811731,Baelin's Route - An Epic NPC Man Adventurer,A short-film following Baelin the Fisherman as...,3/3/20,https://www.kickstarter.com/projects/vldl/bael...,2348079,True,False
2399,3328105,Elder Dice: Unspeakable Tomes - Cthulhu Mythos...,"Lovecraftian designs: Yellow Sign of Hastur, S...",3/20/18,https://www.kickstarter.com/projects/infiniteb...,2364559,True,False

In [38]:
# push the profile data to the database
temp_profile_df.to_sql(name='profile', con=engine, if_exists='append', index=False)

400

In [39]:
temp_creator_df= df[['creator_id', 'creator_name','creator_url','id','profile_id']]

In [40]:
# Drop duplicated creator_id
temp_creator_df = temp_creator_df.drop_duplicates(subset='creator_id')

In [41]:
temp_creator_df

,creator_id,creator_name,creator_url,id,profile_id
0,74501917,Dragonsteel Entertainment,https://www.kickstarter.com/profile/dragonsteel,1497949659,4334820
1,597507018,Pebble Technology,https://www.kickstarter.com/profile/getpebble,1799979574,1695644
2,203090294,Ryan Grepper,https://www.kickstarter.com/profile/ryangrepper,342886736,746867
3,1350948450,Isaac Childres,https://www.kickstarter.com/profile/frosthaven,374744378,3930828
5,2121023188,Kingdom Death,https://www.kickstarter.com/profile/poots,545070200,2752819
...,...,...,...,...,...
2391,1358607332,Rockwell Razors,https://www.kickstarter.com/profile/rockwellra...,1630663160,2363828
2392,276738145,Foldscope - Manu Prakash & Jim Cybulski,https://www.kickstarter.com/profile/foldscope,2052751372,2706405
2393,606457671,Architects of Destruction,https://www.kickstarter.com/profile/606457671,1230044425,3212290
2395,948407605,PrÃªt Ã Pousser,https://www.kickstarter.com/profile/pretapousser,1570490740,4391654
2397,556218342,Bargain Quest Games,https://www.kickstarter.com/profile/bargainquest,339311773,3401128

In [42]:
# drop null values based on the 'profile_id' column
temp_creator_df  = temp_creator_df.dropna(subset=['profile_id'])

In [43]:
temp_creator_df

,creator_id,creator_name,creator_url,id,profile_id
0,74501917,Dragonsteel Entertainment,https://www.kickstarter.com/profile/dragonsteel,1497949659,4334820
1,597507018,Pebble Technology,https://www.kickstarter.com/profile/getpebble,1799979574,1695644
2,203090294,Ryan Grepper,https://www.kickstarter.com/profile/ryangrepper,342886736,746867
3,1350948450,Isaac Childres,https://www.kickstarter.com/profile/frosthaven,374744378,3930828
5,2121023188,Kingdom Death,https://www.kickstarter.com/profile/poots,545070200,2752819
...,...,...,...,...,...
2391,1358607332,Rockwell Razors,https://www.kickstarter.com/profile/rockwellra...,1630663160,2363828
2392,276738145,Foldscope - Manu Prakash & Jim Cybulski,https://www.kickstarter.com/profile/foldscope,2052751372,2706405
2393,606457671,Architects of Destruction,https://www.kickstarter.com/profile/606457671,1230044425,3212290
2395,948407605,PrÃªt Ã Pousser,https://www.kickstarter.com/profile/pretapousser,1570490740,4391654
2397,556218342,Bargain Quest Games,https://www.kickstarter.com/profile/bargainquest,339311773,3401128

In [44]:
# push the creator data to the database
temp_creator_df.to_sql(name='creator', con=engine, if_exists='append', index=False)

602

In [45]:
temp_currency_info_df= df[['currency', 'fx_rate']]

In [46]:
temp_currency_info_df

     currency   fx_rate
0         USD  1.000000
1         USD  1.000000
2         USD  1.000000
3         USD  1.000000
4         USD  1.000000
...       ...       ...
2395      EUR  1.089325
2396      USD  1.000000
2397      USD  1.000000
2398      NZD  0.647259
2399      USD  1.000000

[2400 rows x 2 columns]

In [47]:
# Drop duplicated currency
temp_currency_info_df = temp_currency_info_df.drop_duplicates(subset='currency')

In [48]:
# push the creator data to the database
temp_currency_info_df.to_sql(name='currency_info', con=engine, if_exists='append', index=False)

14

In [49]:
temp_creation_currency_df= df[['creator_id','currency']]

In [50]:
temp_creation_currency_df

      creator_id currency
0       74501917      USD
1      597507018      USD
2      203090294      USD
3     1350948450      USD
4      597507018      USD
...          ...      ...
2395   948407605      EUR
2396  1172937197      USD
2397   556218342      USD
2398  1729426295      NZD
2399  1624931577      USD

[2400 rows x 2 columns]

In [51]:
# Drop duplicated creator_id
temp_creation_currency_df = temp_creation_currency_df.drop_duplicates(subset='creator_id')

In [52]:
temp_creation_currency_df

      creator_id currency
0       74501917      USD
1      597507018      USD
2      203090294      USD
3     1350948450      USD
5     2121023188      USD
...          ...      ...
2391  1358607332      USD
2392   276738145      USD
2393   606457671      USD
2395   948407605      EUR
2397   556218342      USD

[1602 rows x 2 columns]

In [53]:
# push the creation_currency data to the database
temp_creation_currency_df.to_sql(name='creation_currency', con=engine, if_exists='append', index=False)

602

In [54]:
temp_profile_state_info_df= df[['profile_state','profile_state_changed_at','state','state_changed_at']]

In [55]:
temp_profile_state_info_df.insert(0, 'state_id', range(1, 1 + len(temp_profile_state_info_df)))

In [56]:
temp_profile_state_info_df

,state_id,profile_state,profile_state_changed_at,state,state_changed_at
0,1,active,3/31/22,successful,3/31/22
1,2,active,3/29/15,successful,3/28/15
2,3,active,4/3/15,successful,8/30/14
3,4,active,5/1/20,successful,5/1/20
4,5,active,6/30/16,successful,6/30/16
...,...,...,...,...,...
2395,2396,active,5/28/22,successful,5/28/22
2396,2397,active,12/8/17,successful,12/8/17
2397,2398,active,9/14/18,successful,8/28/18
2398,2399,active,4/2/20,successful,4/2/20
2399,2400,active,4/13/18,successful,4/13/18

In [57]:
# push the profile_state_info data to the database
temp_profile_state_info_df.to_sql(name='profile_state_info', con=engine, if_exists='append', index=False)

400

In [58]:
temp_usd_pledged_df= df[['usd_pledged','percent_funded','usd_type','static_usd_rate','usd_exchange_rate']]

In [59]:
temp_usd_pledged_df.insert(0, 'usd_pledged_id', range(1, 1 + len(temp_usd_pledged_df)))

In [60]:
temp_usd_pledged_df

,usd_pledged_id,usd_pledged,percent_funded,usd_type,static_usd_rate,usd_exchange_rate
0,1,4.175415e+07,4175.415324,domestic,1.000000,1.000000
1,2,2.033899e+07,4067.797254,domestic,1.000000,1.000000
2,3,1.328523e+07,26570.452720,domestic,1.000000,1.000000
3,4,1.296961e+07,2593.921600,domestic,1.000000,1.000000
4,5,1.277984e+07,1277.984349,domestic,1.000000,1.000000
...,...,...,...,...,...,...
2395,2396,3.890298e+05,3655.970000,international,1.064095,1.073215
2396,2397,3.920500e+05,392.050000,international,1.000000,1.000000
2397,2398,3.920455e+05,1306.818500,international,1.000000,1.000000
2398,2399,4.097955e+05,165.297465,international,0.619785,0.592847
2399,2400,3.918815e+05,922.074118,international,1.000000,1.000000

In [61]:
# push the usd_pledged data to the database
temp_usd_pledged_df.to_sql(name='usd_pledged', con=engine, if_exists='append', index=False)

400

In [62]:
temp_profile_state_df= df[['profile_id']]

In [63]:
temp_profile_state_df.insert(0, 'state_id', range(1, 1 + len(temp_profile_state_df)))

In [64]:
temp_profile_state_df

      state_id  profile_id
0            1     4334820
1            2     1695644
2            3      746867
3            4     3930828
4            5     2516776
...        ...         ...
2395      2396     4391654
2396      2397     2993952
2397      2398     3401128
2398      2399     3811731
2399      2400     3328105

[2400 rows x 2 columns]

In [65]:
# push the profile state data to the database
temp_profile_state_df.to_sql(name='profile_state', con=engine, if_exists='append', index=False)

400

In [66]:
temp_project_pledged_df= df[['profile_id']]

In [67]:
temp_project_pledged_df.insert(0, 'usd_pledged_id', range(1, 1 + len(temp_project_pledged_df)))

In [68]:
temp_project_pledged_df

      usd_pledged_id  profile_id
0                  1     4334820
1                  2     1695644
2                  3      746867
3                  4     3930828
4                  5     2516776
...              ...         ...
2395            2396     4391654
2396            2397     2993952
2397            2398     3401128
2398            2399     3811731
2399            2400     3328105

[2400 rows x 2 columns]

In [69]:
# push the profile state data to the database
temp_project_pledged_df.to_sql(name='project_pledged', con=engine, if_exists='append', index=False)

400